Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>libp2p</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # github_membership.this["DannyS03"] will be destroyed
  # (because key ["DannyS03"] is not in for_each map)
  - resource "github_membership" "this" {
      - etag     = "W/\"7bb77233a1881ced5d825a95fab567de62830782d24ca60f91e499f3168161b0\"" -> null
      - id       = "libp2p:DannyS03" -> null
      - role     = "member" -> null
      - username = "DannyS03" -> null
    }

  # github_membership.this["shahankhatch"] will be created
  + resource "github_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "shahankhatch"
    }

  # github_repository.this["docs"] will be updated in-place
  ~ resource "github_repository" "this" {
      ~ description            = "***WIP**** Official documentation for the libp2p project." -> "***WIP**** 🤖 📚 Documentation website for the libp2p project. https://docs.libp2p.io/"
        id                     = "docs"
        name                   = "docs"
      ~ topics                 = [
          - "documentation",
          - "knowledge-base",
          - "networking",
            # (4 unchanged elements hidden)
        ]
        # (27 unchanged attributes hidden)
    }

  # github_repository.this["website-1"] will be destroyed
  # (because key ["website-1"] is not in for_each map)
  - resource "github_repository" "this" {
      - allow_auto_merge       = false -> null
      - allow_merge_commit     = true -> null
      - allow_rebase_merge     = true -> null
      - allow_squash_merge     = true -> null
      - archived               = false -> null
      - auto_init              = false -> null
      - branches               = [
          - {
              - name      = "master"
              - protected = false
            },
        ] -> null
      - default_branch         = "master" -> null
      - delete_branch_on_merge = false -> null
      - description            = "Webpage of the libp2p project. A multi protocol approach for a interoperable network stack that follows the 'self description' in favor of assumptions" -> null
      - etag                   = "W/\"c928a7c8b6f2e11271f8ddb73882a4918e7eb105515085b3e59b71db05c47abf\"" -> null
      - full_name              = "libp2p/website-1" -> null
      - git_clone_url          = "git://github.com/libp2p/website-1.git" -> null
      - has_downloads          = true -> null
      - has_issues             = false -> null
      - has_projects           = true -> null
      - has_wiki               = false -> null
      - homepage_url           = "https://libp2p.io" -> null
      - html_url               = "https://github.com/libp2p/website-1" -> null
      - http_clone_url         = "https://github.com/libp2p/website-1.git" -> null
      - id                     = "website-1" -> null
      - is_template            = false -> null
      - name                   = "website-1" -> null
      - node_id                = "R_kgDOH4F-Ew" -> null
      - private                = false -> null
      - repo_id                = 528580115 -> null
      - ssh_clone_url          = "git@github.com:libp2p/website-1.git" -> null
      - svn_url                = "https://github.com/libp2p/website-1" -> null
      - topics                 = [] -> null
      - visibility             = "public" -> null
      - vulnerability_alerts   = false -> null
    }

  # github_repository_collaborator.this["docs:jennijuju"] will be destroyed
  # (because key ["docs:jennijuju"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "docs:jennijuju" -> null
      - permission = "maintain" -> null
      - repository = "docs" -> null
      - username   = "jennijuju" -> null
    }

  # github_repository_collaborator.this["docs:johnnymatthews"] will be destroyed
  # (because key ["docs:johnnymatthews"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "docs:johnnymatthews" -> null
      - permission = "admin" -> null
      - repository = "docs" -> null
      - username   = "johnnymatthews" -> null
    }

  # github_repository_collaborator.this["website-1:DannyS03"] will be destroyed
  # (because key ["website-1:DannyS03"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "website-1:DannyS03" -> null
      - permission = "admin" -> null
      - repository = "website-1" -> null
      - username   = "DannyS03" -> null
    }

  # github_repository_collaborator.this["website:DannyS03"] will be destroyed
  # (because key ["website:DannyS03"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id         = "website:DannyS03" -> null
      - permission = "maintain" -> null
      - repository = "website" -> null
      - username   = "DannyS03" -> null
    }

  # github_repository_collaborator.this["website:dannys03"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "maintain"
      + permission_diff_suppression = false
      + repository                  = "website"
      + username                    = "dannys03"
    }

  # github_team_membership.this["Alumni:shahankhatch"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "6201424"
      + username = "shahankhatch"
    }

  # github_team_membership.this["Repos - Go:MarcoPolo"] will be destroyed
  # (because key ["Repos - Go:MarcoPolo"] is not in for_each map)
  - resource "github_team_membership" "this" {
      - etag     = "W/\"70b9db6160fd7c4d12738b1224560becb0ed80344650cb10d7e394f2743fa328\"" -> null
      - id       = "2100801:MarcoPolo" -> null
      - role     = "member" -> null
      - team_id  = "2100801" -> null
      - username = "MarcoPolo" -> null
    }

  # github_team_membership.this["Repos - Go:julian88110"] will be destroyed
  # (because key ["Repos - Go:julian88110"] is not in for_each map)
  - resource "github_team_membership" "this" {
      - etag     = "W/\"160accdfb9ac611a9fe0a2f449524bdf028657e12b3adb8bcf995b3dc57597f3\"" -> null
      - id       = "2100801:julian88110" -> null
      - role     = "member" -> null
      - team_id  = "2100801" -> null
      - username = "julian88110" -> null
    }

  # github_team_membership.this["docs:DannyS03"] will be destroyed
  # (because key ["docs:DannyS03"] is not in for_each map)
  - resource "github_team_membership" "this" {
      - etag     = "W/\"5a57039075e5785770fd25f3d92ca552bc08b4fc44f10020bba28a7bf3f7006a\"" -> null
      - id       = "5688138:DannyS03" -> null
      - role     = "maintainer" -> null
      - team_id  = "5688138" -> null
      - username = "DannyS03" -> null
    }

  # github_team_membership.this["docs:dannys03"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = "5688138"
      + username = "dannys03"
    }

  # github_team_repository.this["docs:docs"] will be updated in-place
  ~ resource "github_team_repository" "this" {
        id         = "5688138:docs"
      ~ permission = "maintain" -> "pull"
        # (3 unchanged attributes hidden)
    }

  # github_team_repository.this["go-libp2p Maintainers:go-libp2p-relay-daemon"] will be destroyed
  # (because key ["go-libp2p Maintainers:go-libp2p-relay-daemon"] is not in for_each map)
  - resource "github_team_repository" "this" {
      - etag       = "W/\"e21f29b830f6ba11531891129c4ea765ca46f86de020c6acbfe2702455d9e75e\"" -> null
      - id         = "5253535:go-libp2p-relay-daemon" -> null
      - permission = "push" -> null
      - repository = "go-libp2p-relay-daemon" -> null
      - team_id    = "5253535" -> null
    }

Plan: 4 to add, 2 to change, 10 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->